Updated diagram
